In [1]:
# 모듈 로딩
import pandas as pd
import numpy as np

In [2]:
# 데이터 생성
titanic = pd.read_csv('/Users/anhyojun/VSCode/K-Digital Training/Pandas/숙제/titanic.csv')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

> survived(생존 여부) : 0 = 사망, 1 = 생존  
pclass(수치형 객실 등급) : 1 = 1등석, 2 = 2등석, 3 = 3등석  
sex(성별) : male = 남성, female = 여성  
age(나이)  
sibsp(동승한 형제 및 배우자의 수)  
parch(동승한 부모 및 자식의 수)  
fare(승객 요금)   
embarked(탑승지) : C = 셰르부르, Q = 퀸즈타운, S = 사우샘프턴  
class(문자형 객실 등급) : First = 1등석, Second = 2등석, Third = 3등석  
who(남자, 여자, 아이) : man, woman, child  
adult_male : True(성인 남자), False(그 외)  
deck(선실 번호 첫 글자) : A, B, C, D, E, F, G  
embark_town(탑승지 이름) : Cherbourg, Queenstown, Southampton  
alive(생존 여부) : no(사망), yes(생존)  
alone(혼자 탑승 여부) : True(혼자 탑승), False(동승 탑승)

In [22]:
# 데이터 정보
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

### 유사한 데이터 제거 작업

In [35]:
# survived와 alive가 같은 데이터인지 확인하기
survive_data = titanic.loc[:, ['survived', 'alive']]
survive_data.value_counts()

survived  alive
0         no       549
1         yes      342
Name: count, dtype: int64

> 확인 결과 두 데이터는 같다.  
따라서 alive 변수를 제거하기로 결정한다.

In [36]:
# pclass와 class가 같은 데이터인지 확인하기
class_data = titanic.loc[:, ['pclass', 'class']]
class_data.value_counts()

pclass  class
3       Third     491
1       First     216
2       Second    184
Name: count, dtype: int64

> 확인 결과 두 데이터는 같다.   
따라서 class 변수를 제거하기로 결정한다.

In [38]:
# embarked와 embark_town이 같은 데이터인지 확인하기
embark_data = titanic.loc[:, ['embarked', 'embark_town']]
embark_data.value_counts()

embarked  embark_town
S         Southampton    644
C         Cherbourg      168
Q         Queenstown      77
Name: count, dtype: int64

> 확인 결과 두 데이터는 같다.   
따라서 embark_town 변수를 제거하기로 결정한다.

In [42]:
df = titanic.drop(['alive', 'class', 'embark_town'], axis = 1)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    891 non-null    int64
 1   pclass      891 non-null    int64
 2   sex         891 non-null    object
 3   age         714 non-null    float64
 4   sibsp       891 non-null    int64
 5   parch       891 non-null    int64
 6   fare        891 non-null    float64
 7   embarked    889 non-null    object
 8   who         891 non-null    object
 9   adult_male  891 non-null    bool
 10  deck        203 non-null    object
 11  alone       891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(4)
memory usage: 71.5+ KB

> survived(생존 여부) : 0 = 사망, 1 = 생존  
pclass(수치형 객실 등급) : 1 = 1등석, 2 = 2등석, 3 = 3등석  
sex(성별) : male = 남성, female = 여성  
age(나이)  
sibsp(동승한 형제 및 배우자의 수)  
parch(동승한 부모 및 자식의 수)  
fare(승객 요금)   
embarked(탑승지) : C = 셰르부르, Q = 퀸즈타운, S = 사우샘프턴  
who(남자, 여자, 아이) : man, woman, child  
adult_male : True(성인 남자), False(그 외)  
deck(선실 번호 첫 글자) : A, B, C, D, E, F, G   
alone(혼자 탑승 여부) : True(혼자 탑승), False(동승 탑승)

In [43]:
# 결측치 개수 확인
df.isna().sum()
# age: 177개, embarked: 2개, deck: 688개

survived        0
pclass          0
sex             0
age           177
sibsp           0
parch           0
fare            0
embarked        2
who             0
adult_male      0
deck          688
alone           0
dtype: int64

In [51]:
# deck 변수의 범주 확인
df['deck'].value_counts()

deck
C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: count, dtype: int64

> deck 변수의 경우 결측치가 너무 많아 결측치를 다른 값으로 대체 하기에는 대체한 값들의 대표성이 너무 부족해지며 결측치인 행들을 모두 제거하자니 데이터의 손실이 크기 때문에 deck 컬럼을 제거하기로 결정

In [55]:
# 결측치 확인
df2 = df.drop(['deck'], axis = 1)
df2.isna().sum()

survived        0
pclass          0
sex             0
age           177
sibsp           0
parch           0
fare            0
embarked        2
who             0
adult_male      0
alone           0
dtype: int64

In [56]:
# age변수의 범주 확인
df2['age'].value_counts()

age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [62]:
# age 변수의 평균 확인
df2['age'].mean()

29.69911764705882

> age 변수의 경우 결측치를 평균값으로 대체하기에는 평균값에 해당하는 20대의 빈도가 너무 늘어날 것 같기 때문에 age가 결측인 행을 모두 제거하기로 결정

In [66]:
df2.dropna(axis = 0, subset = ['age'])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,alone
0,0,3,male,22.0,1,0,7.2500,S,man,True,False
1,1,1,female,38.0,1,0,71.2833,C,woman,False,False
2,1,3,female,26.0,0,0,7.9250,S,woman,False,True
3,1,1,female,35.0,1,0,53.1000,S,woman,False,False
4,0,3,male,35.0,0,0,8.0500,S,man,True,True
...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,woman,False,False
886,0,2,male,27.0,0,0,13.0000,S,man,True,True
887,1,1,female,19.0,0,0,30.0000,S,woman,False,True
889,1,1,male,26.0,0,0,30.0000,C,man,True,True
890,0,3,male,32.0,0,0,7.7500,Q,man,True,True